[
  {
    "title": "If you were an animal, which one would you want to be?",
    "answer": "<p class='mb-5'><img width='50%' src='/img/octopus.svg'></p>",
    "example": "console.log('I would probably be a octopus - with more than 2 hands.')"
  },
  {
    "title": "What are some of your strengths and weaknesses?",
    "answer": "A closure is the combination of a function and the lexical environment within which that function was declared. i.e, It is an inner function that has access to the outer or enclosing function’s variables. The closure has three scope chains. <p class='my-10'>Own scope where variables defined between its curly brackets Outer function’s variables Global variables Let's take an example of closure concept</p>",
    "example": "function Welcome(name){\n var greetingInfo = function(message){ \n  console.log(message+' '+name);\n }\n return greetingInfo;\n}\nvar myFunction = Welcome('John');\nmyFunction('Welcome '); //Output: Welcome John\nmyFunction('Hello Mr.'); //output: Hello Mr.John"
  },
  {
    "title": "Why did you leave your last job?",
    "answer": "Scope is the accessibility of variables, functions, and objects in some particular part of your code during runtime. In other words, scope determines the visibility of variables and other resources in areas of your code.",
    "error": "TypeError: can't answer such personal questions."
  },
  {
    "title": "Do you work better alone or as part of a team?",
    "answer": "<p>Depending on the industry and company values, they could be looking for a specific answer. However, the ability to collaborate and compromise are always desirable traits in an employee. If you're unsure, say that you prefer a mixture of the two.</p>"
  },
  {
    "title": "How do you handle stressful situations?",
    "answer": "<p class='my-10'>You want to highlight your ability to face stressful situations in a manner that is both productive and positive. Try mentioning some of your stress-relieving tactics, and then provide an anecdote about a time that you effectively handled a particularly stressful situation.</p>"
  },
  {
    "title": "Change one thing about your personality, what would it be?"
  },
  {
    "title": "What makes you unique?"
  },
  {
    "title": "Can you tell me about a time when you went above and beyond in your job?"
  },
  {
    "title": "What drives you in your professional life?"
  },
  {
    "title": "Describe a time when you dealt with change."
  },
  {
    "title": "What are you passionate about?"
  },
  {
    "title": "Are you easy to talk to? "
  },
  {
    "title": "What motivates you?"
  },
  {
    "title": "When was the last time you were angry? What happened?"
  },
  {
    "title": "What do you find are the most difficult decisions to make?"
  }
]
